mizrachiran/brewos/src/esp32/src/web_server_websocket.cpp
    // Use shared command processor
    processCommand(doc);
}

/**
 * Processes a command received in JSON format.
 * 
 * This method is called from both handleWsMessage() (for local WebSocket commands)
 * and from the cloud connection command callback (for cloud-originated commands).
 * It handles commands from either source in a unified way.
 */
void BrewWebServer::processCommand(JsonDocument& doc) {
    String type = doc["type"] | "";
    
    if (type == "ping") {
        LOG_I("Command: ping");
        _picoUart.sendPing();
    }
    else if (type == "request_state" || type == "request_full_status") {
        // Client requesting full state (local WebSocket or cloud) - check heap first
        // We use pre-allocated PSRAM buffers, so we mainly need enough for the send queue
        size_t freeHeap = ESP.getFreeHeap();
        const size_t MIN_HEAP_FOR_STATE_BROADCAST = 35000;  // Need 35KB (state uses PSRAM buffers)
        
        // If this is from cloud server (not proactive), cancel pending proactive broadcast
        // to avoid duplicate state sends
        String source = doc["source"] | "";
        if (source != "proactive" && _cloudConnection) {
            _cloudConnection->cancelPendingStateBroadcast();
        }
        
        if (freeHeap < MIN_HEAP_FOR_STATE_BROADCAST) {
            // Heap critically low - schedule deferred broadcast
            LOG_W("Scheduling deferred state broadcast (heap=%zu, need %zu)", 
                  freeHeap, MIN_HEAP_FOR_STATE_BROADCAST);
            _pendingCloudStateBroadcast = true;
            _pendingCloudStateBroadcastTime = millis() + 3000;  // Try in 3 seconds
            return;
        }
        
        LOG_I("Sending full state to client (heap=%zu)", freeHeap);
        _pendingCloudStateBroadcast = false;
        // Send full status and device info
        // Note: broadcastFullStatus will send full status (not delta) on next call
        // because the change detector will be reset or this is an explicit request
        broadcastFullStatus(runtimeState().get());
        broadcastDeviceInfo();
    }
    else if (type == "getConfig") {
        LOG_I("Command: getConfig");
        _picoUart.requestConfig();
    }
    else if (type == "setLogLevel") {
        // Set log level from WebSocket command
        // Expected payload: { type: "setLogLevel", level: "debug" | "info" | "warn" | "error" }
        String levelStr = doc["level"] | "info";
        LOG_I("Command: setLogLevel=%s", levelStr.c_str());
        BrewOSLogLevel level = stringToLogLevel(levelStr.c_str());
        setLogLevel(level);
        broadcastLog("Log level set to: %s", logLevelToString(level));
    }
    else if (type == "command") {
        // Handle commands from web UI
        String cmd = doc["cmd"] | "";
        LOG_I("Command: %s", cmd.c_str());
        
        // Route to category-specific handlers
        if (cmd == "set_eco" || cmd == "enter_eco" || cmd == "exit_eco" || cmd == "set_temp") {
            handleTemperatureCommand(doc, cmd);
        }
        else if (cmd == "set_mode") {
            handleModeCommand(doc, cmd);
        }
        else if (cmd == "mqtt_test" || cmd == "mqtt_config") {
            handleMqttCommand(doc, cmd);
        }
        else if (cmd == "set_cloud_config") {
            handleCloudCommand(doc, cmd);
        }
        else if (cmd == "add_schedule" || cmd == "update_schedule" || cmd == "delete_schedule" || 
                 cmd == "toggle_schedule" || cmd == "set_auto_off" || cmd == "get_schedules") {
            handleScheduleCommand(doc, cmd);
        }
        else if (cmd == "scale_scan" || cmd == "scale_scan_stop" || cmd == "scale_connect" || 
                 cmd == "scale_disconnect" || cmd == "tare" || cmd == "scale_tare" || cmd == "scale_reset") {
            handleScaleCommand(doc, cmd);
        }
        else if (cmd == "set_bbw") {
            handleBrewByWeightCommand(doc, cmd);
        }
        else if (cmd == "set_preinfusion") {
            handlePreinfusionCommand(doc, cmd);
        }
        else if (cmd == "set_power" || cmd == "set_power_config") {
            handlePowerCommand(doc, cmd);
        }
        else if (cmd == "configure_power_meter" || cmd == "start_power_meter_discovery") {
            handlePowerMeterCommand(doc, cmd);
        }
        else if (cmd == "wifi_forget" || cmd == "wifi_config") {
            handleWiFiCommand(doc, cmd);
        }
        else if (cmd == "restart" || cmd == "factory_reset") {
            handleSystemCommand(doc, cmd);
        }
        else if (cmd == "check_update" || cmd == "ota_start" || cmd == "esp32_ota_start" || 
                 cmd == "pico_ota_start" || cmd == "check_version_mismatch") {
            handleOtaCommand(doc, cmd);
        }
        else if (cmd == "set_machine_info" || cmd == "set_device_info") {
            handleMachineInfoCommand(doc, cmd);
        }
        else if (cmd == "set_preferences") {
            handlePreferencesCommand(doc, cmd);
        }
        else if (cmd == "set_time_config" || cmd == "get_time_status" || cmd == "sync_time") {
            handleTimeCommand(doc, cmd);
        }
        else if (cmd == "record_maintenance") {
            handleMaintenanceCommand(doc, cmd);
        }
        else if (cmd == "run_diagnostics" || cmd == "run_diagnostic_test") {
            handleDiagnosticsCommand(doc, cmd);
        }
    }
}

// =============================================================================
// Command Handlers - Organized by Category
// =============================================================================

void BrewWebServer::handleTemperatureCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "set_eco") {
        // Set eco mode configuration
        // Pico is the source of truth, but we persist on ESP32 as backup/cache
        // Payload: enabled (bool), brewTemp (float), timeout (int minutes)
        bool enabled = doc["enabled"] | true;
        float brewTemp = doc["brewTemp"] | 80.0f;
        int timeout = doc["timeout"] | 30;
        
        // Validate inputs
        if (brewTemp < 50.0f || brewTemp > 120.0f) {
            broadcastLogLevel("error", "Invalid eco temp: %.1f°C (range: 50-120°C)", brewTemp);
            return;
        }
        if (timeout < 1 || timeout > 1440) {
            broadcastLogLevel("error", "Invalid eco timeout: %d min (range: 1-1440 min)", timeout);
            return;
        }
        
        // Update and persist settings on ESP32 (backup/cache even if Pico is source of truth)
        auto& tempSettings = State.settings().temperature;
        tempSettings.ecoBrewTemp = brewTemp;
        tempSettings.ecoTimeoutMinutes = (uint16_t)timeout;
        State.saveTemperatureSettings();  // Persist as backup
        
