mizrachiran/brewos/src/esp32/src/web_server_websocket.cpp
        char jsonBuffer[256];
        serializeJson(response, jsonBuffer);
        broadcastRaw(jsonBuffer);
    }
    else if (cmd == "mqtt_config") {
        // Update MQTT config
        MQTTConfig config = _mqttClient.getConfig();
        
        if (!doc["enabled"].isNull()) config.enabled = doc["enabled"].as<bool>();
        if (!doc["broker"].isNull()) strncpy(config.broker, doc["broker"].as<const char*>(), sizeof(config.broker) - 1);
        if (!doc["port"].isNull()) config.port = doc["port"].as<uint16_t>();
        if (!doc["username"].isNull()) strncpy(config.username, doc["username"].as<const char*>(), sizeof(config.username) - 1);
        if (!doc["password"].isNull()) {
            const char* pwd = doc["password"].as<const char*>();
            if (pwd && strlen(pwd) > 0) {
                strncpy(config.password, pwd, sizeof(config.password) - 1);
            }
        }
        if (!doc["topic"].isNull()) {
            strncpy(config.topic_prefix, doc["topic"].as<const char*>(), sizeof(config.topic_prefix) - 1);
        }
        if (!doc["discovery"].isNull()) config.ha_discovery = doc["discovery"].as<bool>();
        
        if (_mqttClient.setConfig(config)) {
            // Also update StateManager to keep both storage locations in sync
            // This prevents settings from being lost on reboot (StateManager loads first and overwrites MQTTClient)
            auto& mqttSettings = State.settings().mqtt;
            mqttSettings.enabled = config.enabled;
            strncpy(mqttSettings.broker, config.broker, sizeof(mqttSettings.broker) - 1);
            mqttSettings.broker[sizeof(mqttSettings.broker) - 1] = '\0';
            mqttSettings.port = config.port;
            strncpy(mqttSettings.username, config.username, sizeof(mqttSettings.username) - 1);
            mqttSettings.username[sizeof(mqttSettings.username) - 1] = '\0';
            strncpy(mqttSettings.password, config.password, sizeof(mqttSettings.password) - 1);
            mqttSettings.password[sizeof(mqttSettings.password) - 1] = '\0';
            strncpy(mqttSettings.baseTopic, config.topic_prefix, sizeof(mqttSettings.baseTopic) - 1);
            mqttSettings.baseTopic[sizeof(mqttSettings.baseTopic) - 1] = '\0';
            mqttSettings.discovery = config.ha_discovery;
            State.saveMQTTSettings();  // Persist to NVS "settings" namespace
            
            broadcastLogLevel("info", "MQTT configuration updated");
            
            // Broadcast updated MQTT status to all clients
            broadcastMqttStatus();
        }
    }
}

void BrewWebServer::handleCloudCommand(JsonDocument& doc, const String& cmd) {
    // Update cloud config
    auto& cloudSettings = State.settings().cloud;
    bool wasEnabled = cloudSettings.enabled;
    
    if (!doc["enabled"].isNull()) {
        cloudSettings.enabled = doc["enabled"].as<bool>();
    }
    if (!doc["serverUrl"].isNull()) {
        const char* url = doc["serverUrl"].as<const char*>();
        if (url) {
            strncpy(cloudSettings.serverUrl, url, sizeof(cloudSettings.serverUrl) - 1);
            cloudSettings.serverUrl[sizeof(cloudSettings.serverUrl) - 1] = '\0';
        }
    }
    
    // Save settings to NVS
    State.saveCloudSettings();
    
    // Update pairing manager and cloud connection based on enabled state
    if (cloudSettings.enabled && strlen(cloudSettings.serverUrl) > 0) {
        // Initialize pairing manager with new URL
        if (_pairingManager) {
            _pairingManager->begin(String(cloudSettings.serverUrl));
            
            // Get device credentials from pairing manager
            String deviceId = _pairingManager->getDeviceId();
            String deviceKey = _pairingManager->getDeviceKey();
            
            // Sync device ID to cloud settings
            if (String(cloudSettings.deviceId) != deviceId) {
                strncpy(cloudSettings.deviceId, deviceId.c_str(), sizeof(cloudSettings.deviceId) - 1);
                State.saveCloudSettings();
            }
            
            // Start the cloud WebSocket connection
            startCloudConnection(String(cloudSettings.serverUrl), deviceId, deviceKey);
            
            broadcastLog("Cloud enabled: %s", cloudSettings.serverUrl);
        }
    } else if (!cloudSettings.enabled && wasEnabled) {
        // Cloud was disabled - stop cloud connection
        if (_cloudConnection) {
            _cloudConnection->end();
            broadcastLogLevel("info", "Cloud connection stopped");
        }
        if (_pairingManager) {
            _pairingManager->begin("");  // Clear cloud URL
        }
        broadcastLogLevel("info", "Cloud disabled");
    }
    
    broadcastLog("Cloud configuration updated: %s", cloudSettings.enabled ? "enabled" : "disabled");
}

void BrewWebServer::handleScheduleCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "add_schedule") {
        // Add a new schedule
        BrewOS::ScheduleEntry entry;
        entry.fromJson(doc.as<JsonObjectConst>());
        
        uint8_t newId = State.addSchedule(entry);
        if (newId > 0) {
            broadcastLog("Schedule added: %s", entry.name);
            broadcastDeviceInfo();  // Notify all clients of schedule changes
        }
    }
    else if (cmd == "update_schedule") {
        // Update existing schedule
        uint8_t id = doc["id"] | 0;
        if (id > 0) {
            BrewOS::ScheduleEntry entry;
            entry.fromJson(doc.as<JsonObjectConst>());
            if (State.updateSchedule(id, entry)) {
                broadcastLogLevel("info", "Schedule updated");
                broadcastDeviceInfo();  // Notify all clients of schedule changes
            }
        }
    }
    else if (cmd == "delete_schedule") {
        // Delete schedule
        uint8_t id = doc["id"] | 0;
        if (id > 0 && State.removeSchedule(id)) {
            broadcastLogLevel("info", "Schedule deleted");
            broadcastDeviceInfo();  // Notify all clients of schedule changes
        }
    }
    else if (cmd == "toggle_schedule") {
        // Enable/disable schedule
        uint8_t id = doc["id"] | 0;
        bool enabled = doc["enabled"] | false;
        if (id > 0 && State.enableSchedule(id, enabled)) {
            broadcastDeviceInfo();  // Notify all clients of schedule changes
        }
    }
    else if (cmd == "set_auto_off") {
        // Set auto power-off settings
        bool enabled = doc["enabled"] | false;
        uint16_t minutes = doc["minutes"] | 60;
        State.setAutoPowerOff(enabled, minutes);
        broadcastLogLevel("info", "Auto power-off updated");
        broadcastDeviceInfo();  // Notify all clients of schedule changes
    }
    else if (cmd == "get_schedules") {
        // Return schedules to requesting client
        broadcastDeviceInfo();
    }
}

void BrewWebServer::handleScaleCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "scale_scan") {
        if (!scaleManager || !scaleManager->isScanning()) {
            if (scaleManager && scaleManager->isConnected()) {
                scaleManager->disconnect();
            }
            scaleManager->clearDiscovered();
            scaleManager->startScan(15000);
            broadcastLogLevel("info", "BLE scale scan started");
        }
    }
    else if (cmd == "scale_scan_stop") {
        scaleManager->stopScan();
        broadcastLogLevel("info", "BLE scale scan stopped");
    }
    else if (cmd == "scale_connect") {
        String address = doc["address"] | "";
        if (!address.isEmpty()) {
            scaleManager->connect(address.c_str());
            // Pre-format message to avoid String.c_str() issues
            char scaleMsg[64];
            snprintf(scaleMsg, sizeof(scaleMsg), "Connecting to scale: %s", address.c_str());
            broadcastLog(scaleMsg);
        }
    }
    else if (cmd == "scale_disconnect") {
        scaleManager->disconnect();
        broadcastLogLevel("info", "Scale disconnected");
    }
    else if (cmd == "tare" || cmd == "scale_tare") {
        scaleManager->tare();
        broadcastLogLevel("info", "Scale tared");
    }
    else if (cmd == "scale_reset") {
        scaleManager->tare();
        brewByWeight->reset();
        broadcastLogLevel("info", "Scale reset");
    }
}

void BrewWebServer::handleBrewByWeightCommand(JsonDocument& doc, const String& cmd) {
    // Accept both camelCase (from web client) and snake_case field names
    // Target weight
    if (!doc["targetWeight"].isNull()) {
        brewByWeight->setTargetWeight(doc["targetWeight"].as<float>());
    } else if (!doc["target_weight"].isNull()) {
        brewByWeight->setTargetWeight(doc["target_weight"].as<float>());
    }
    // Dose weight
    if (!doc["doseWeight"].isNull()) {
        brewByWeight->setDoseWeight(doc["doseWeight"].as<float>());
    } else if (!doc["dose_weight"].isNull()) {
        brewByWeight->setDoseWeight(doc["dose_weight"].as<float>());
    }
    // Stop offset
    if (!doc["stopOffset"].isNull()) {
        brewByWeight->setStopOffset(doc["stopOffset"].as<float>());
    } else if (!doc["stop_offset"].isNull()) {
        brewByWeight->setStopOffset(doc["stop_offset"].as<float>());
    }
    // Enabled / Auto-stop (enabled in UI maps to auto_stop in ESP32)
    if (!doc["enabled"].isNull()) {
        brewByWeight->setAutoStop(doc["enabled"].as<bool>());
    } else if (!doc["auto_stop"].isNull()) {
        brewByWeight->setAutoStop(doc["auto_stop"].as<bool>());
    }
    // Auto-tare
    if (!doc["autoTare"].isNull()) {
        brewByWeight->setAutoTare(doc["autoTare"].as<bool>());
    } else if (!doc["auto_tare"].isNull()) {
        brewByWeight->setAutoTare(doc["auto_tare"].as<bool>());
    }
    
    // Note: brewByWeight->saveSettings() is called by each setter method,
    // so settings are already persisted to brewByWeight's own NVS storage.
    // StateManager has separate brew settings storage that's synced via broadcastDeviceInfo()
    
    broadcastLogLevel("info", "Brew-by-weight settings updated");
    
    // Broadcast updated BBW settings to all clients (including cloud)
    broadcastBBWSettings();
}

void BrewWebServer::handlePreinfusionCommand(JsonDocument& doc, const String& cmd) {
    bool enabled = doc["enabled"] | false;
    uint16_t onTimeMs = doc["onTimeMs"] | 3000;
    uint16_t pauseTimeMs = doc["pauseTimeMs"] | 5000;
    
    // Validate timing parameters
    if (onTimeMs > 10000) {
        broadcastLogLevel("error", "Pre-infusion on_time too long (max 10000ms)");
    } else if (pauseTimeMs > 30000) {
        broadcastLogLevel("error", "Pre-infusion pause_time too long (max 30000ms)");
    } else {
        // Build payload for Pico: [config_type, enabled, on_time_ms(2), pause_time_ms(2)]
        uint8_t payload[6];
        payload[0] = CONFIG_PREINFUSION;  // Config type
        payload[1] = enabled ? 1 : 0;
        payload[2] = onTimeMs & 0xFF;         // Low byte
        payload[3] = (onTimeMs >> 8) & 0xFF;  // High byte
        payload[4] = pauseTimeMs & 0xFF;      // Low byte
        payload[5] = (pauseTimeMs >> 8) & 0xFF; // High byte
        
        if (_picoUart.sendCommand(MSG_CMD_CONFIG, payload, sizeof(payload))) {
            // Update ESP32 state for persistence
            auto& settings = State.settings();
            settings.brew.preinfusionTime = onTimeMs / 1000.0f;  // Store as seconds
            settings.brew.preinfusionPressure = enabled ? 1.0f : 0.0f;  // Use as enabled flag
            settings.brew.preinfusionPauseMs = pauseTimeMs;  // Store pause/soak time
            State.saveBrewSettings();
            
            broadcastLogLevel("info", "Pre-infusion settings saved: %s, on=%dms, pause=%dms", 
                     enabled ? "enabled" : "disabled", onTimeMs, pauseTimeMs);
            // Broadcast updated device info so UI refreshes
            broadcastDeviceInfo();
        } else {
            broadcastLogLevel("error", "Failed to send pre-infusion config to Pico");
        }
    }
}

void BrewWebServer::handlePowerCommand(JsonDocument& doc, const String& cmd) {
    // Pico is the source of truth, but we persist on ESP32 as backup/cache
    uint16_t voltage = doc["voltage"] | 230;
    uint8_t maxCurrent = doc["maxCurrent"] | 15;
    
    // Validate inputs
    if (voltage < 100 || voltage > 240) {
        broadcastLogLevel("error", "Invalid voltage: %dV (range: 100-240V)", voltage);
        return;
    }
    if (maxCurrent < 1 || maxCurrent > 30) {
        broadcastLogLevel("error", "Invalid max current: %dA (range: 1-30A)", maxCurrent);
        return;
    }
    
    // Update and persist settings on ESP32 (backup/cache even if Pico is source of truth)
    State.settings().power.mainsVoltage = voltage;
    State.settings().power.maxCurrent = (float)maxCurrent;
    State.savePowerSettings();  // Persist as backup
    
    // Send to Pico as environmental config (Pico will persist it)
    uint8_t payload[4];
    payload[0] = CONFIG_ENVIRONMENTAL;  // Config type
    payload[1] = (voltage >> 8) & 0xFF;
    payload[2] = voltage & 0xFF;
    payload[3] = maxCurrent;
    if (_picoUart.sendCommand(MSG_CMD_CONFIG, payload, 4)) {
        broadcastLog("Power settings saved: %dV, %dA", voltage, maxCurrent);
        // Broadcast updated device info so UI refreshes
        broadcastDeviceInfo();
    } else {
        broadcastLogLevel("error", "Failed to send power config to Pico (saved locally as backup)");
    }
}

