mizrachiran/brewos/src/esp32/src/web_server_websocket.cpp
void BrewWebServer::handlePowerMeterCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "configure_power_meter") {
        String source = doc["source"] | "none";
        
        if (source == "none") {
            powerMeterManager->setSource(PowerMeterSource::NONE);
            // Send disable command to Pico
            uint8_t payload[1] = {0};  // 0 = disabled
            _picoUart.sendCommand(MSG_CMD_POWER_METER_CONFIG, payload, 1);
            broadcastLogLevel("info", "Power metering disabled");
        }
        else if (source == "hardware") {
            // Hardware meters are configured on Pico
            powerMeterManager->configureHardware();
            
            // Send enable command to Pico
            uint8_t payload[1] = {1};  // 1 = enabled
            _picoUart.sendCommand(MSG_CMD_POWER_METER_CONFIG, payload, 1);
            broadcastLogLevel("info", "Power meter configured (hardware)");
        }
        else if (source == "mqtt") {
            String topic = doc["topic"] | "";
            String format = doc["format"] | "auto";
            
            if (topic.length() > 0) {
                if (powerMeterManager && powerMeterManager->configureMqtt(topic.c_str(), format.c_str())) {
                    // Pre-format message to avoid String.c_str() issues
                    char mqttMsg[64];
                    snprintf(mqttMsg, sizeof(mqttMsg), "MQTT power meter configured: %s", topic.c_str());
                    broadcastLog(mqttMsg);
                } else {
                    broadcastLogLevel("error", "Failed to configure MQTT power meter");
                }
            } else {
                broadcastLogLevel("error", "MQTT topic required");
            }
        }
        
        // Broadcast updated status
        broadcastPowerMeterStatus();
    }
    else if (cmd == "start_power_meter_discovery") {
        // Forward discovery command to Pico
        _picoUart.sendCommand(MSG_CMD_POWER_METER_DISCOVER, nullptr, 0);
        powerMeterManager->startAutoDiscovery();
        broadcastLogLevel("info", "Starting power meter auto-discovery...");
    }
}

void BrewWebServer::handleWiFiCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "wifi_forget") {
        _wifiManager.clearCredentials();
        broadcastLogLevel("warn", "WiFi credentials cleared. Device will restart.");
        delay(1000);
        ESP.restart();
    }
    else if (cmd == "wifi_config") {
        // Static IP configuration
        bool staticIp = doc["staticIp"] | false;
        String ip = doc["ip"] | "";
        String gateway = doc["gateway"] | "";
        String subnet = doc["subnet"] | "255.255.255.0";
        String dns1 = doc["dns1"] | "";
        String dns2 = doc["dns2"] | "";
        
        _wifiManager.setStaticIP(staticIp, ip, gateway, subnet, dns1, dns2);
        
        if (staticIp) {
            // Pre-format message to avoid String.c_str() issues
            char ipMsg[64];
            snprintf(ipMsg, sizeof(ipMsg), "Static IP configured: %s. Reconnecting...", ip.c_str());
            broadcastLog(ipMsg);
        } else {
            broadcastLogLevel("info", "DHCP mode enabled. Reconnecting...");
        }
        
        // Reconnect to apply new settings
        delay(500);
        _wifiManager.connectToWiFi();
    }
}

void BrewWebServer::handleSystemCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "restart") {
        broadcastLogLevel("warn", "Device restarting...");
        delay(500);
        ESP.restart();
    }
    else if (cmd == "factory_reset") {
        broadcastLogLevel("warn", "Factory reset initiated...");
        State.factoryReset();
        _wifiManager.clearCredentials();
        delay(1000);
        ESP.restart();
    }
}

void BrewWebServer::handleOtaCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "check_update") {
        // Check for OTA updates from GitHub releases
        checkForUpdates();
    }
    else if (cmd == "ota_start") {
        // Update BrewOS firmware (combined: Pico first, then ESP32)
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startCombinedOTA(version);
        }
    }
    else if (cmd == "esp32_ota_start") {
        // ESP32 only - for recovery/advanced use
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startGitHubOTA(version);
        }
    }
    else if (cmd == "pico_ota_start") {
        // Pico only - for recovery/advanced use
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startPicoGitHubOTA(version);
        }
    }
    else if (cmd == "check_version_mismatch") {
        // Check and report firmware version mismatch
        checkVersionMismatch();
    }
}

void BrewWebServer::handleMachineInfoCommand(JsonDocument& doc, const String& cmd) {
    auto& machineInfo = State.settings().machineInfo;
    auto& networkSettings = State.settings().network;
    
    if (!doc["name"].isNull()) {
        strncpy(machineInfo.deviceName, doc["name"].as<const char*>(), sizeof(machineInfo.deviceName) - 1);
        machineInfo.deviceName[sizeof(machineInfo.deviceName) - 1] = '\0';
        // Also update hostname for mDNS
        strncpy(networkSettings.hostname, doc["name"].as<const char*>(), sizeof(networkSettings.hostname) - 1);
        networkSettings.hostname[sizeof(networkSettings.hostname) - 1] = '\0';
    }
    // Accept both "brand" and "machineBrand" field names for compatibility
    const char* brandValue = nullptr;
    if (!doc["brand"].isNull()) {
        brandValue = doc["brand"].as<const char*>();
    } else if (!doc["machineBrand"].isNull()) {
        brandValue = doc["machineBrand"].as<const char*>();
    }
    if (brandValue) {
        strncpy(machineInfo.machineBrand, brandValue, sizeof(machineInfo.machineBrand) - 1);
        machineInfo.machineBrand[sizeof(machineInfo.machineBrand) - 1] = '\0';
    }
    // Accept both "model" and "machineModel" field names for compatibility
    const char* modelValue = nullptr;
    if (!doc["model"].isNull()) {
        modelValue = doc["model"].as<const char*>();
    } else if (!doc["machineModel"].isNull()) {
        modelValue = doc["machineModel"].as<const char*>();
    }
    if (modelValue) {
        strncpy(machineInfo.machineModel, modelValue, sizeof(machineInfo.machineModel) - 1);
        machineInfo.machineModel[sizeof(machineInfo.machineModel) - 1] = '\0';
    }
    if (!doc["machineType"].isNull()) {
        const char* machineTypeStr = doc["machineType"].as<const char*>();
        strncpy(machineInfo.machineType, machineTypeStr, sizeof(machineInfo.machineType) - 1);
        machineInfo.machineType[sizeof(machineInfo.machineType) - 1] = '\0';
        
