mizrachiran/brewos/src/esp32/src/web_server_websocket.cpp
        // Also set the numeric machine type (used by State.getMachineType())
        // This allows manual setting when Pico doesn't send MSG_BOOT
        uint8_t numericType = 0; // 0 = unknown
        if (strcmp(machineTypeStr, "dual_boiler") == 0) {
            numericType = 1;
        } else if (strcmp(machineTypeStr, "single_boiler") == 0) {
            numericType = 2;
        } else if (strcmp(machineTypeStr, "heat_exchanger") == 0) {
            numericType = 3;
        } else if (strcmp(machineTypeStr, "thermoblock") == 0) {
            numericType = 4;
        }
        
        if (numericType != 0) {
            State.setMachineType(numericType, true);  // force=true to override Pico's value
            LOG_I("Machine type set from UI: %s (%d)", machineTypeStr, numericType);
        } else {
            LOG_W("Unknown machine type string: %s", machineTypeStr);
        }
    }
    
    State.saveMachineInfoSettings();
    
    // Send machine brand/model to Pico (source of truth)
    if (brandValue || modelValue) {
        // Get current values (in case only one was updated)
        char currentBrand[32];
        char currentModel[32];
        strncpy(currentBrand, machineInfo.machineBrand, sizeof(currentBrand) - 1);
        currentBrand[sizeof(currentBrand) - 1] = '\0';
        strncpy(currentModel, machineInfo.machineModel, sizeof(currentModel) - 1);
        currentModel[sizeof(currentModel) - 1] = '\0';
        
        // Prepare payload for CONFIG_MACHINE_INFO
        // Payload: 1 byte config_type + 31 bytes data (15+16 for brand+model)
        // Total: 32 bytes (within PROTOCOL_MAX_PAYLOAD limit)
        uint8_t payload[32];
        payload[0] = CONFIG_MACHINE_INFO;  // Machine brand and model
        memset(&payload[1], 0, 31);  // Zero out string fields
        strncpy((char*)&payload[1], currentBrand, 14);  // Brand (max 14 chars, 15 bytes including null)
        strncpy((char*)&payload[16], currentModel, 15);  // Model (max 15 chars, 16 bytes including null)
        
        if (_picoUart.sendCommand(MSG_CMD_CONFIG, payload, sizeof(payload))) {
            LOG_I("Sent machine info to Pico: %s %s", currentBrand, currentModel);
        } else {
            LOG_W("Failed to send machine info to Pico");
        }
    }
    
    State.saveNetworkSettings();
    
    // Broadcast device info update
    broadcastDeviceInfo();
    broadcastLog("Device info updated: %s", machineInfo.deviceName);
}

void BrewWebServer::handlePreferencesCommand(JsonDocument& doc, const String& cmd) {
    auto& prefs = State.settings().preferences;
    
    if (!doc["firstDayOfWeek"].isNull()) {
        const char* dow = doc["firstDayOfWeek"];
        prefs.firstDayOfWeek = (strcmp(dow, "monday") == 0) ? 1 : 0;
    }
    if (!doc["use24HourTime"].isNull()) {
        prefs.use24HourTime = doc["use24HourTime"];
    }
    if (!doc["temperatureUnit"].isNull()) {
        const char* unit = doc["temperatureUnit"];
        prefs.temperatureUnit = (strcmp(unit, "fahrenheit") == 0) ? 1 : 0;
    }
    if (!doc["electricityPrice"].isNull()) {
        prefs.electricityPrice = doc["electricityPrice"].as<float>();
    }
    if (!doc["currency"].isNull()) {
        strncpy(prefs.currency, doc["currency"].as<const char*>(), sizeof(prefs.currency) - 1);
        prefs.currency[sizeof(prefs.currency) - 1] = '\0';
    }
    if (!doc["lastHeatingStrategy"].isNull()) {
        prefs.lastHeatingStrategy = doc["lastHeatingStrategy"];
    }
    
    // Mark as initialized once browser sends first preferences
    prefs.initialized = true;
    
    State.saveUserPreferences();
    broadcastDeviceInfo();
    broadcastLogLevel("info", "User preferences updated");
}

void BrewWebServer::handleTimeCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "set_time_config") {
        auto& timeSettings = State.settings().time;
        
        if (!doc["useNTP"].isNull()) timeSettings.useNTP = doc["useNTP"].as<bool>();
        if (!doc["ntpServer"].isNull()) {
            strncpy(
                timeSettings.ntpServer,
                doc["ntpServer"].as<const char*>(),
                sizeof(timeSettings.ntpServer) - 1
            );
        }
        if (!doc["utcOffsetMinutes"].isNull()) timeSettings.utcOffsetMinutes = doc["utcOffsetMinutes"].as<int16_t>();
        if (!doc["dstEnabled"].isNull()) timeSettings.dstEnabled = doc["dstEnabled"].as<bool>();
        if (!doc["dstOffsetMinutes"].isNull()) timeSettings.dstOffsetMinutes = doc["dstOffsetMinutes"].as<int16_t>();
        
        State.saveTimeSettings();
        
        // Apply new NTP settings
        _wifiManager.configureNTP(
            timeSettings.ntpServer,
            timeSettings.utcOffsetMinutes,
            timeSettings.dstEnabled,
            timeSettings.dstOffsetMinutes
        );
        
        broadcastDeviceInfo();
        broadcastLogLevel("info", "Time settings updated");
    }
    else if (cmd == "get_time_status") {
        // Get time status (for UI polling)
        TimeStatus ts = _wifiManager.getTimeStatus();
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
        StaticJsonDocument<512> tsDoc;
        #pragma GCC diagnostic pop
        tsDoc["type"] = "time_status";
        tsDoc["synced"] = ts.ntpSynced;
        tsDoc["currentTime"] = ts.currentTime;
        tsDoc["timezone"] = ts.timezone;
        tsDoc["utcOffset"] = ts.utcOffset;
        
        size_t jsonSize = measureJson(tsDoc) + 1;
        char* jsonBuffer = allocateJsonBuffer(jsonSize);
        if (jsonBuffer) {
            serializeJson(tsDoc, jsonBuffer, jsonSize);
            broadcastRaw(jsonBuffer);
            free(jsonBuffer);
        }
    }
    else if (cmd == "sync_time") {
        // Force NTP sync
        if (_wifiManager.isConnected()) {
            _wifiManager.syncNTP();
            broadcastLogLevel("info", "NTP sync initiated");
        } else {
            broadcastLogLevel("error", "Cannot sync time: WiFi not connected");
        }
    }
}

void BrewWebServer::handleMaintenanceCommand(JsonDocument& doc, const String& cmd) {
    String type = doc["type"] | "";
    if (!type.isEmpty()) {
        State.recordMaintenance(type.c_str());
        // Pre-format message to avoid String.c_str() issues
        char maintMsg[64];
        snprintf(maintMsg, sizeof(maintMsg), "Maintenance recorded: %s", type.c_str());
        broadcastLog(maintMsg);
    }
}

